BlakeStrebel/2R-Robots/BackupAndUI/TM4C Examples/PWM/pwm.c
/*################################################
# Hardware PWM using the Tiva C Launchpad
# 
# Comments by Benjamen Lim
#
# Adapted from
# https://github.com/szczys/tiva-c-launchpad-hardware-pwm/blob/master/main.c
#
# Started with example code by
# lawrence_jeff found here:
# http://forum.stellarisiti.com/topic/707-using-hardware-pwm-on-tiva-launchpad/
#
# Altered to use code found on section
# 22.3 of the TivaWare Peripheral Driver
# Library User's Guide found here:
# http://www.ti.com/lit/ug/spmu298a/spmu298a.pdf
#
#
# This example pulses three on-board LEDs
#
#################################################*/


#include "driverlib/pin_map.h"
#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_gpio.h"
#include "inc/hw_types.h"
#include "inc/hw_memmap.h"
#include "driverlib/sysctl.h"
#include "driverlib/pin_map.h"
#include "driverlib/gpio.h"
#include "driverlib/pwm.h"

void delayMS(int ms) {
    // Get the frequency of the system clock
    // Divide by 1000 to get ms
    // Each SysCtlDelay is 3 clocks
    SysCtlDelay( (SysCtlClockGet()/(1000*3))*ms ) ;
}

int
main(void)
{
    // Set the clock 50MHz
    // The system clock generated by the PLL is always 400Mhz independent of input sources, 
    // There is a default divide by 2 applied so the system clock after applying PLL is 200Mhz.
    // Users can modify this by adding different dividing factors in the SYSCTL_SYSDIV for a lower frequency system clock
    
    
    // SysCtlClockSet(SYSCTL_SYSDIV_4|SYSCTL_USE_PLL|SYSCTL_XTAL_16MHZ | SYSCTL_OSC_MAIN);
    

    // Set the clock to an external oscillator

   SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_OSC |  SYSCTL_OSC_MAIN | SYSCTL_XTAL_16MHZ);

   //Configure PWM Clock to match system
   SysCtlPWMClockSet(SYSCTL_PWMDIV_1);

   // Enable the peripherals used by this program.
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM1);  //The Tiva Launchpad has two modules (0 and 1). Module 1 covers the LED pins

    //Configure PF1,PF2,PF3 Pins as PWM
    GPIOPinConfigure(GPIO_PF1_M1PWM5); 
    GPIOPinConfigure(GPIO_PF2_M1PWM6); 
    GPIOPinConfigure(GPIO_PF3_M1PWM7); 
    GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3); 

    //Configure PWM Options
    //PWM_GEN_2 Covers M1PWM4 and M1PWM5
    //PWM_GEN_3 Covers M1PWM6 and M1PWM7 See page 207 4/11/13 DriverLib doc
    PWMGenConfigure(PWM1_BASE, PWM_GEN_2, PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC); \
    PWMGenConfigure(PWM1_BASE, PWM_GEN_3, PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);

    // Set the Period (expressed in clock ticks)
    // To calculate the appropriate parameter
    // use the following equation: N = (1 / f) * SysClk.  Where N is the
    // function parameter, f is the desired frequency, and SysClk is the
    // system clock frequency.
    // In this case you get: (1 / 12500  Hz) * 4MHz = 320 cycles.  Note that
    // the maximum period you can set is 2^16 - 1.
    PWMGenPeriodSet(PWM1_BASE, PWM_GEN_2, 320);
    PWMGenPeriodSet(PWM1_BASE, PWM_GEN_3, 320);

    //Set PWM duty-50% (Period /2)
    PWMPulseWidthSet(PWM1_BASE, PWM_OUT_5,160);
    PWMPulseWidthSet(PWM1_BASE, PWM_OUT_6,160);
    PWMPulseWidthSet(PWM1_BASE, PWM_OUT_7,160);

    // Enable the PWM generator
    PWMGenEnable(PWM1_BASE, PWM_GEN_2);
    PWMGenEnable(PWM1_BASE, PWM_GEN_3);

    // Turn on the Output pins
    PWMOutputState(PWM1_BASE, PWM_OUT_5_BIT | PWM_OUT_6_BIT | PWM_OUT_7_BIT, true);

    //Fade
    bool fadeUp = true;
    unsigned long increment = 10;
    unsigned long pwmNow = 100;
    while(1)
    {
        delayMS(20);
        if (fadeUp) {
            pwmNow += increment;
            if (pwmNow >= 370) {
                fadeUp = false;
            }
        }
        else {
            pwmNow -= increment;
            if (pwmNow <= 60) {
                fadeUp = true;
            }
        }
        PWMPulseWidthSet(PWM1_BASE, PWM_OUT_5,10);
        PWMPulseWidthSet(PWM1_BASE, PWM_OUT_6,pwmNow);
        PWMPulseWidthSet(PWM1_BASE, PWM_OUT_7,10);
    }

}
